{
  "blogs": [
    {
      "id": 1,
      "title": "‘Venom 2’: release date, plot details, cast and everything we know so far",
      "description": "Sony’s take on Venom, starring the one and only Tom Hardy, was an action-packed and very silly big-screen adaptation of the Marvel character’s story. And if you enjoyed seeing Mr Hardy transforming into a horrific spider-like alien in 2018, then good news! A sequel is heading to the big screen later this year (coronavirus permitting).",
      "author": "Aqueeb shaikh",
      "date": "2021-11-10",
      "slug": "Venom-2-release-date"
    },
    {
      "title": "‘The Matrix 4’: release date, trailers, cast and everything we know so far",
      "description": "In 2021, the most famous sci-fi franchise of them all will be returning for a fourth round. Yep, Keanu Reeves, Carrie-Anne Moss and more will be back alongside director Lana Wachowski for a fourth film in the legendary Matrix series.",
      "author": "Will Richards",
      "date": "2021-09-16",
      "id": 2,
      "slug": "The-Matrix-4-release"
    },
    {
      "title": "Introducing Zero-Bundle-Size React Server Components",
      "description": "2020 has been a long year. As it comes to an end we wanted to share a special Holiday Update on our research into zero-bundle-size React Server Components.\n\nTo introduce React Server Components, we have prepared a talk and a demo. If you want, you can check them out during the holidays, or later when work picks back up in the new year.",
      "author": "Dan Abramov",
      "date": "2021-12-02",
      "id": 3,
      "slug": "Introducing-Zero-Bun"
    },
    {
      "title": "React v17.0",
      "description": "Today, we are releasing React 17! We’ve written at length about the role of the React 17 release and the changes it contains in the React 17 RC blog post. This post is a brief summary of it, so if you’ve already read the RC post, you can skip this one.",
      "author": "Dan Abramov",
      "date": "2021-11-18",
      "id": 4,
      "slug": "React-v17-0"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ]
}